tap "homebrew/bundle"
tap "homebrew/services"
tap "mdogan/zulu"
tap "swiftyfinch/rugby", "https://github.com/swiftyfinch/Rugby.git"
tap "tuist/tuist"
brew "bmake"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "cocoapods"
brew "codespell"
brew "cppcheck"
brew "fastlane"
brew "ffmpeg"
brew "gcc"
brew "git"
brew "git-filter-repo"
brew "gnuplot"
brew "htop"
brew "imagemagick"
brew "llvm"
brew "include-what-you-use"
brew "iperf3"
brew "jq"
brew "lcov"
brew "make"
brew "maven"
brew "ncdu"
brew "neovim"
brew "ninja"
brew "p7zip"
brew "parallel"
brew "pipenv"
brew "podman"
brew "rbenv"
brew "sourcery"
brew "telnet"
brew "tldr"
brew "tmux"
brew "tree"
brew "universal-ctags"
brew "vim"
brew "wget"
brew "yt-dlp"
cask "alacritty"
cask "android-studio"
cask "appcleaner"
cask "bitwarden"
cask "firefox"
cask "font-iosevka"
cask "google-chrome"
cask "obsidian"
cask "qbittorrent"
cask "slack"
cask "steam"
cask "sweet-home3d"
cask "telegram"
cask "the-unarchiver"
cask "tuist"
cask "visual-studio-code"
cask "zulu-jdk19"
vscode "asvetliakov.vscode-neovim"
vscode "eamodio.gitlens"
vscode "github.github-vscode-theme"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "pkief.material-icon-theme"
vscode "twxs.cmake"
vscode "xaver.clang-format"
