# Usage:
# /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"
# brew bundle install --file=~./Brewfile

tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"

tap "mdogan/zulu"
tap "swiftyfinch/rugby", "https://github.com/swiftyfinch/Rugby.git"
tap "tuist/tuist"

brew "clang-format"
brew "cloc"
brew "cmake"
brew "cocoapods"
brew "codespell"
brew "cppcheck"
brew "fastlane"
brew "gcc"
brew "ffmpeg"
brew "gifsicle"
brew "git"
brew "imagemagick"
brew "iperf3"
brew "lcov"
brew "llvm"
brew "make"
brew "maven"
brew "ncdu"
brew "ninja"
brew "p7zip"
brew "pipenv"
brew "podman"
brew "rbenv"
brew "sourcery"
brew "tldr"
brew "tmux"
brew "tree"
brew "universal-ctags"
brew "vim"
brew "wget"
brew "yt-dlp"
brew "tuist/tuist/tuist@4.7.0"

cask "alacritty"
cask "android-studio"
cask "appcleaner"
cask "bitwarden"
cask "discord"
cask "firefox"
cask "font-iosevka"
cask "google-chrome"
cask "intellij-idea-ce"
cask "krita"
cask "nextcloud"
cask "obsidian"
cask "postman"
cask "qbittorrent"
cask "slack"
cask "steam"
cask "sublime-text"
cask "sweet-home3d"
cask "telegram"
cask "the-unarchiver"
cask "visualvm"
cask "yandex"
cask "zoom"
cask "zulu-jdk19"
cask "zulu-jdk21"
